AccumulationRegisters/АР_ВзаиморасчетыПоАренде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_ВзаиморасчетыПоАренде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчетаПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетНаАренду</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Депозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/АР_НачисленияПоТарифицируемымУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_НачисленияПоТарифицируемымУслугам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ТелефоныКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АР_Ставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_Ставки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.АР_ГрафикиИзмененияСтавокНаУслуги</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_СпособыНачисленияАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АР_КурсыВалютДляРасчетовСАрендаторами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_КурсыВалютДляРасчетовСАрендаторами</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СпособыРасчетаКурсаВалюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НижняяГраница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерхняяГраница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/АР_СпособыРасчетаКурсаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СпособыРасчетаКурсаВалюты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/АР_ПроцедурыНачисленияПереопределяемый/Ext/Module.bsl
Функция ПолучитьПараметрыНачисленияПени(Запрос) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("СпособНачисленияПени, СтавкаПени, ОтсрочкаПоОплате, УчитыватьТолькоРабочиеДниПросрочки,
		|СрокОплаты, УчитыватьТолькоРабочиеДниОтсрочки, МесяцСрокаОплаты, СпособПогашенияПени, СпособРасчетаПросрочки");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПроизводственныйКалендарьЗаполненНаПериод(ДоговорКонтрагента, МоментВремени) Экспорт
	
	ПроизводственныйКалендарь = Константы.АР_ОсновнойПроизводственныйКалендарьАренды.Получить();
	Если ПроизводственныйКалендарь.Пустая() Тогда
		ТекстОшибки = "В настройках учета не выбран основной производственный календарь. Расчет не выполнен";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь; 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МоментВремени) Тогда
		Возврат Ложь;
	КонецЕсли;
	ДатаЗаключения = АР_ПроцедурыНачисления.ОпределитьДатуЗаключенияДоговораНаДату(ДоговорКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	Запрос.УстановитьПараметр("НачПериода", Год(ДатаЗаключения));
	Запрос.УстановитьПараметр("КонПериода", Год(МоментВремени));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПроизводственногоКалендаря.Год
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Год МЕЖДУ &НачПериода И &КонПериода
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь";
	Рез = Запрос.Выполнить().Выгрузить();
	КалендарьЗаполнен = Истина;
	Для К = Год(ДатаЗаключения) По Год(МоментВремени) Цикл
		Если Рез.Найти(К, "Год") = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен производственный календарь на " + Формат(К, "ЧГ=0") + " год. Обработка не выполнена");
			КалендарьЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат КалендарьЗаполнен;
	
КонецФункции

Функция ПолучитьЗапросДляРасчетаРабочихДней(ДоговорКонтрагента, МоментВремени) Экспорт 
	
	СписокРабочихДней = Новый СписокЗначений;
	СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	СписокРабочихДней.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	ПроизводственныйКалендарь = Константы.АР_ОсновнойПроизводственныйКалендарьАренды.Получить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочийДень", СписокРабочихДней);
	Запрос.УстановитьПараметр("НачПериодаКалендаря", АР_ПроцедурыНачисления.ОпределитьДатуЗаключенияДоговораНаДату(ДоговорКонтрагента));
	Запрос.УстановитьПараметр("КонПериодаКалендаря", ДобавитьМесяц(?(ТипЗнч(МоментВремени) = Тип("Дата"), НачалоДня(МоментВремени), НачалоДня(МоментВремени.Дата)), 1));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);

	Запрос.Текст = ПолучитьТекстЗапросаДляРасчетаРабочихДней();
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляРасчетаРабочихДней()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня В (&РабочийДень)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоРабочийДень
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &НачПериодаКалендаря И &КонПериодаКалендаря
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьРегистрВзаиморасчетовКакВременнуюТаблицу(Запрос) Экспорт
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрВзаиморасчетов.Период,
	|	РегистрВзаиморасчетов.Регистратор,
	|	РегистрВзаиморасчетов.НомерСтроки,
	|	РегистрВзаиморасчетов.Активность,
	|	РегистрВзаиморасчетов.ВидДвижения,
	|	РегистрВзаиморасчетов.Организация,
	|	РегистрВзаиморасчетов.Контрагент,
	|	РегистрВзаиморасчетов.ДоговорКонтрагента,
	|	РегистрВзаиморасчетов.УслугаАренды,
	|	РегистрВзаиморасчетов.ОбъектАренды,
	|	РегистрВзаиморасчетов.СчетНаАренду,
	|	РегистрВзаиморасчетов.ПериодАренды,
	|	РегистрВзаиморасчетов.Депозит,
	|	РегистрВзаиморасчетов.ДокументРасчетов,
	|	РегистрВзаиморасчетов.Валюта,
	|	РегистрВзаиморасчетов.Пени,
	|	РегистрВзаиморасчетов.Сумма,
	|	РегистрВзаиморасчетов.СуммаВзаиморасчетов,
	|	РегистрВзаиморасчетов.ЗачетАванса,
	|	РегистрВзаиморасчетов.ДатаРасчетаПени,
	|	РегистрВзаиморасчетов.ДокументОплаты
	|ПОМЕСТИТЬ ВТРегистрВзаиморасчетов
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде КАК РегистрВзаиморасчетов";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыПоАренде.Организация,
	|	ВзаиморасчетыПоАренде.Контрагент,
	|	ВзаиморасчетыПоАренде.ДоговорКонтрагента,
	|	ВзаиморасчетыПоАренде.УслугаАренды,
	|	ВзаиморасчетыПоАренде.ОбъектАренды,
	|	ВзаиморасчетыПоАренде.СчетНаАренду,
	|	ВзаиморасчетыПоАренде.ПериодАренды,
	|	ВзаиморасчетыПоАренде.Депозит,
	|	ВзаиморасчетыПоАренде.ДокументРасчетов,
	|	ВзаиморасчетыПоАренде.Валюта,
	|	ВзаиморасчетыПоАренде.Пени,
	|	ВзаиморасчетыПоАренде.СуммаОборот,
	|	ВзаиморасчетыПоАренде.СуммаПриход,
	|	ВзаиморасчетыПоАренде.СуммаРасход,
	|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовОборот,
	|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовПриход КАК Сумма,
	|	ВзаиморасчетыПоАренде.СуммаВзаиморасчетовРасход
	|ПОМЕСТИТЬ ВТРегистрВзаиморасчетовОбороты
	|ИЗ
	|	РегистрНакопления.АР_ВзаиморасчетыПоАренде.Обороты(
	|			,
	|			&МоментНачисленияПени,
	|			,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И НЕ Пени) КАК ВзаиморасчетыПоАренде";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура УстановитьНачислениеПоТарифицируемымУслугамКакВременнуюТаблицу(Запрос) Экспорт
	
	ПониженныеВидыСтавок = Новый Массив;
	ЗначениеОбщейСтавкиНДС = 0;
	ЗначениеПониженнойСтавкиНДС = 0;
	Дата = ТекущаяДата();
	
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.Пониженная);
	ПониженныеВидыСтавок.Добавить(Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная);
	
	ОбщаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Дата);
	ПониженнаяСтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Пониженная, Дата);
	
	ЗначениеОбщейСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
	ЗначениеПониженнойСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ПониженнаяСтавкаНДС);

	Запрос.УстановитьПараметр("ПониженныеВидыСтавок", ПониженныеВидыСтавок);
	Запрос.УстановитьПараметр("ЗначениеОбщейСтавкиНДС", ЗначениеОбщейСтавкиНДС);
	Запрос.УстановитьПараметр("ЗначениеПониженнойСтавкиНДС", ЗначениеПониженнойСтавкиНДС);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды КАК Услуга,
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.ОбъектАренды КАК ОбъектАренды,
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.Ставка КАК Ставка,
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.КоличествоОборот КАК Количество,
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.СуммаОборот КАК Сумма,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.СпособНачисления, ЗНАЧЕНИЕ(Справочник.АР_СпособыНачисленияАренднойПлаты.ПустаяСсылка)) КАК СпособНачисления,
	//|	АР_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР КОГДА АР_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды.ВидСтавкиНДС В (&ПониженныеВидыСтавок) 
	|         ТОГДА &ЗначениеПониженнойСтавкиНДС
	|         ИНАЧЕ &ЗначениеОбщейСтавкиНДС
	|   КОНЕЦ КАК СтавкаНДС,
	|	ЕСТЬNULL(АР_СтавкиСрезПоследних.СпособНачисления.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта,
	|	АР_НачисленияПоТарифицируемымУслугамОбороты.ДоговорКонтрагента КАК Договор,
	|	АР_СтавкиСрезПоследних.ЕдиницаИзмерения,
	|	АР_СтавкиСрезПоследних.СуммаПоДоговору
	|ПОМЕСТИТЬ ВТРегистрНачисленияПоУслугам
	|ИЗ
	|	РегистрНакопления.АР_НачисленияПоТарифицируемымУслугам.Обороты(
	|			,
	|			,
	|			,
	|			ДоговорКонтрагента = &Договор
	|				И (ПериодАренды МЕЖДУ &НачалоПериода И &КонецПериода)) КАК АР_НачисленияПоТарифицируемымУслугамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&КонецПериода, Договор = &Договор) КАК АР_СтавкиСрезПоследних
	|		ПО АР_НачисленияПоТарифицируемымУслугамОбороты.УслугаАренды = АР_СтавкиСрезПоследних.Услуга
	|			И АР_НачисленияПоТарифицируемымУслугамОбороты.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПереименоватьКолонкиРезультатаПоНачислениюПени(Таблица) Экспорт
	
	// Для данной конфигурации не актуально
	
КонецПроцедуры

Процедура ПереименоватьКолонкиРезультатаПоНачислениюАренды(Таблица) Экспорт
	
	// Для данной конфигурации не актуально
	
КонецПроцедуры

Функция ПолучитьКурсВалюты(Валюта, ДатаКурса, Договор) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Валюта, АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Валюта) КАК Валюта,
	|	ВЫБОР
	|		КОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.СпособРасчета ЕСТЬ NULL 
	|			ТОГДА КурсыВалютСрезПоследних.Курс
	|		КОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаКурсаВалюты.Фиксированный)
	|			ТОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Курс
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) * АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Коэффициент < АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.НижняяГраница
	|					ТОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.НижняяГраница
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) * АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Коэффициент > АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.ВерхняяГраница
	|						И АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.ВерхняяГраница > 0
	|					ТОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.ВерхняяГраница
	|				ИНАЧЕ ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) * АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Коэффициент
	|			КОНЕЦ
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.АР_СпособыРасчетаКурсаВалюты.Фиксированный)
	|			ТОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Кратность
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)
	|	КОНЕЦ КАК Кратность,
	|	ВЫБОР
	|		КОГДА АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Курс ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СпециальныйКурс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.АР_КурсыВалютДляРасчетовСАрендаторами.СрезПоследних(
	|				&ДатаКурса,
	|				ДоговорКонтрагента = &Договор
	|					И Валюта = &Валюта) КАК АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних
	|		ПО КурсыВалютСрезПоследних.Валюта = АР_КурсыВалютДляРасчетовСАрендаторамиСрезПоследних.Валюта";
	
	СтруктураКурса = Новый Структура("Курс, Кратность, СпециальныйКурс");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКурса, Выборка);
	Иначе
		СтруктураКурса.Курс = 1;
		СтруктураКурса.Кратность = 1;
		СтруктураКурса.СпециальныйКурс = Ложь;
	КонецЕсли;
	
	Возврат СтруктураКурса;

КонецФункции // ПолучитьКурсВалюты()

Процедура ЗаполнитьДанныеПоАгентскимУслугам(СтрокаТабличнойЧасти, Организация, Дата = '00010101') Экспорт
	
	ДанныеСобственника = АР_ОбщиеПроцедурыПереопределяемый.ПолучитьСобственника(СтрокаТабличнойЧасти.ОбъектАренды, Дата);
	Если Не СтрокаТабличнойЧасти.Номенклатура.АР_АгентскаяСхема ИЛИ Не ДанныеСобственника.АгентскаяСхема Тогда
		СтрокаТабличнойЧасти.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		СтрокаТабличнойЧасти.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		СтрокаТабличнойЧасти.СчетРасчетов = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	Иначе
		СтрокаТабличнойЧасти.Контрагент = ДанныеСобственника.Собственник;
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДоговорКонтрагента) Тогда
			СтрокаТабличнойЧасти.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСобственника.ДоговорКонтрагента) И ДанныеСобственника.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТабличнойЧасти.ДоговорКонтрагента = ДанныеСобственника.ДоговорКонтрагента;
			СчетаУчета = АР_ОбщиеПроцедурыПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, СтрокаТабличнойЧасти.Контрагент, СтрокаТабличнойЧасти.ДоговорКонтрагента);
			СтрокаТабличнойЧасти.СчетРасчетов = СчетаУчета.СчетРасчетовСКомитентом;
		Иначе
			Если АР_ОбщиеПроцедурыПереопределяемый.УстановитьДоговорКонтрагента(СтрокаТабличнойЧасти.ДоговорКонтрагента, СтрокаТабличнойЧасти.Контрагент, Организация, Перечисления.ВидыДоговоровКонтрагентов.СКомитентом) Тогда
				СчетаУчета = АР_ОбщиеПроцедурыПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, СтрокаТабличнойЧасти.Контрагент, СтрокаТабличнойЧасти.ДоговорКонтрагента);
				СтрокаТабличнойЧасти.СчетРасчетов = СчетаУчета.СчетРасчетовСКомитентом;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьСтавкуПоПериодуДокумента(ДанныеУчета, Объект) Экспорт
	
	Для Каждого Стр Из ДанныеУчета Цикл
		ПериодичностьСтавки = Стр.СпособНачисления.ПериодНачисления;
		Если Не ЗначениеЗаполнено(ПериодичностьСтавки) Тогда
			ПериодичностьСтавки = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
		КонецЕсли;
		// в случае взаиморасчетов по периоду строки разбиваются по периодам начисления договора
		// в случае если период документа день или произвольный, то на периодичность документа не смотрим
		Если Объект.ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам 
			И НЕ Объект.ВидПериода = Перечисления.ДоступныеПериодыОтчета.День 
			И НЕ Объект.ВидПериода = Перечисления.ДоступныеПериодыОтчета.ПроизвольныйПериод Тогда
			
			ПериодичностьСтроки = Объект.ДоговорКонтрагента.АР_Периодичность;
			Если Не ЗначениеЗаполнено(ПериодичностьСтроки) Тогда
				ПериодичностьСтроки = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Объект.ВидПериода) Тогда
				ПериодичностьСтроки = Объект.ВидПериода;
			Иначе
				ПериодичностьСтроки = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
		КонецЕсли;
		
		Стр.Цена = Стр.Цена * АР_ОбщиеПроцедуры.ПолучитьКоэффициентПересчетаПериодов(ПериодичностьСтавки, ПериодичностьСтроки);
		
	КонецЦикла;
	
КонецПроцедуры
